<a href="https://colab.research.google.com/github/YoannRaguenes/Projet-Data-Science-Clubs-De-Foot-Anglais/blob/master/EnglishPlayers.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#English Player Dataset
The purpose of this code is to create a dataset of almost all professional football players in the English leagues.
We will catch the data from websites:

*   https://sofifa.com
*   https://fbref.com

we are going to use the library Beautifulsoup in order to collect informations on the website.

In [0]:
from urllib.request import urlopen
from bs4 import BeautifulSoup
from bs4 import Comment
import pandas as pd
from bs4.element import Tag

###Find the stats of the players
We define our function, the goal of this function is to create a dataframe with some stats about the players.
The shape of the html code is the same for each page, there are tables with the stats for each player in the league.

In [0]:
def getPlayers(Html,div):
  html = urlopen(Html)
  html_soup = BeautifulSoup(html, 'html.parser')
  rows = html_soup.findAll("div",id="all_stats_standard")
  comments =rows[0].findAll(string=lambda text: isinstance(text, Comment))
  for c in comments:
    c.extract()

  sp = BeautifulSoup(c, 'html.parser')
  l = sp.table.tbody.findAll("tr")
  players = []
  for row in range(len(l)):
    if l[row].a!=None :
      player4 = {
                  "name": l[row].a.text,
                  "Nation": l[row].findAll("td",class_="left")[1].text,
                  "Pos": l[row].findAll("td",class_="center")[0].text,
                  "Squad": l[row].findAll("td",class_="left")[2].text,
                 "division": div,
                  "Age": l[row].findAll("td",class_="center")[1].text,
                  "Born": l[row].findAll("td",class_="center")[2].text,
               "MP" : l[row].findAll("td",class_="right group_start")[0].text,
               "Starts" : l[row].findAll("td",class_="right")[1].text,
               "Min" : l[row].findAll("td",class_="right")[2].text,
               "Gls" : l[row].findAll("td",class_="right group_start")[1].text,
               "Ast" : l[row].findAll("td",class_="right")[4].text,
               "PK" : l[row].findAll("td",class_="right")[5].text,
               "PKatt" : l[row].findAll("td",class_="right")[6].text,
               "CrdY" : l[row].findAll("td",class_="right")[7].text,
               "CrdR" : l[row].findAll("td",class_="right")[8].text,
               "Gls/90" : l[row].findAll("td",{"data-stat":"goals_per90"})[0].text,
               "Ast/90" : l[row].findAll("td",class_="right")[10].text,
               "G+A" : l[row].findAll("td",class_="right")[11].text,
               "G-PK" : l[row].findAll("td",class_="right")[12].text,
               "G+A-PK" : l[row].findAll("td",class_="right")[13].text,
               'Contract': None,
               "Value": None ,
               'Release_clause':None

              }
      players.append(player4)
  return players

We use the function for the different leagues

In [0]:
#england
df1 = pd.DataFrame(getPlayers("https://fbref.com/en/comps/9/stats/Premier-League-Stats",1))
df2 = pd.DataFrame(getPlayers("https://fbref.com/en/comps/10/stats/Championship-Stats",2))
df3 = pd.DataFrame(getPlayers("https://fbref.com/en/comps/15/stats/League-One-Stats",3))
df4 = pd.DataFrame(getPlayers("https://fbref.com/en/comps/16/stats/League-Two-Stats",4))
df5 = pd.DataFrame(getPlayers("https://fbref.com/en/comps/34/stats/National-League-Stats",5))
tot = pd.concat([df1,df2,df3,df4,df5])
tot[1:-1].to_csv("ENplayers.csv", encoding="utf-8-sig")

In [0]:
tot = pd.concat([df1,df2,df3,df4,df5])

Read the csv file

In [0]:
tot[1:-1].to_csv("ENplayers.csv", encoding="utf-8-sig")

In [0]:
df = pd.read_csv('ENplayers.csv')
df

      Unnamed: 0           name   Nation  ... Contract Value  Release_clause
0              1     Max Aarons  eng ENG  ...      NaN   NaN             NaN
1              2  Tammy Abraham  eng ENG  ...      NaN   NaN             NaN
2              3      Che Adams  eng ENG  ...      NaN   NaN             NaN
3              4         Adrián   es ESP  ...      NaN   NaN             NaN
4              5  Sergio Agüero   ar ARG  ...      NaN   NaN             NaN
...          ...            ...      ...  ...      ...   ...             ...
3202         670    Mark Yeates   ie IRL  ...      NaN   NaN             NaN
3203         671     Luke Young  eng ENG  ...      NaN   NaN             NaN
3204         672     Adi Yussuf   tz TAN  ...      NaN   NaN             NaN
3205         673     Adi Yussuf   tz TAN  ...      NaN   NaN             NaN
3206         674    Ade Yussuff  eng ENG  ...      NaN   NaN             NaN

[3207 rows x 25 columns]

Now we can do some requests and analysis with this dataframe.

In [0]:
df.loc[ (df['Age']<=20) & (df['Gls']>=10)]

      Unnamed: 0          name  Nation  ... Contract Value  Release_clause
880          389  Bryan Mbeumo  fr FRA  ...      NaN   NaN             NaN
1375         206  Marcus Forss  fi FIN  ...      NaN   NaN             NaN

[2 rows x 25 columns]

In [0]:
df.sort_values(by=["Gls"]).tail(10)

      Unnamed: 0                 name   Nation  ... Contract Value  Release_clause
739          248        Lewis Grabban  eng ENG  ...      NaN   NaN             NaN
3041         509          John Rooney  eng ENG  ...      NaN   NaN             NaN
3026         494           Jamie Reid  nir NIR  ...      NaN   NaN             NaN
3132         600    Kabongo Tshimanga  eng ENG  ...      NaN   NaN             NaN
452          453          Jamie Vardy  eng ENG  ...      NaN   NaN             NaN
3011         479        Scott Quigley  eng ENG  ...      NaN   NaN             NaN
1130         639        Ollie Watkins  eng ENG  ...      NaN   NaN             NaN
903          412  Aleksandar Mitrović   rs SRB  ...      NaN   NaN             NaN
1766         597           Ivan Toney  eng ENG  ...      NaN   NaN             NaN
2002         173           Eoin Doyle   ie IRL  ...      NaN   NaN             NaN

[10 rows x 25 columns]

In [0]:
df.loc[(df['Pos']== 'MF')&(df['Ast']>=10) & (df['Gls']>=5)].sort_values(by=["G+A"])

      Unnamed: 0              name   Nation  ... Contract Value  Release_clause
1092         601        John Swift  eng ENG  ...      NaN   NaN             NaN
2511         682  Randell Williams  eng ENG  ...      NaN   NaN             NaN
1378         209      Scott Fraser  sco SCO  ...      NaN   NaN             NaN
100          101   Kevin De Bruyne   be BEL  ...      NaN   NaN             NaN

[4 rows x 25 columns]